###################################################################

# Created by write_sdc on Sat Apr  4 16:50:12 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_operating_conditions tt0p8v25c -library saed14rvt_base_tt0p8v25c
set_wire_load_mode top
set_wire_load_model -name 16000 -library saed14rvt_base_tt0p8v25c
set_max_transition 0.3 [current_design]
set_max_fanout 5 [current_design]
set_max_capacitance 0.4 [current_design]
set_driving_cell -lib_cell SAEDRVT14_BUF_4 [get_ports reset]
set_load -pin_load 0.05 [get_ports {pc_curr[31]}]
set_load -pin_load 0.05 [get_ports {pc_curr[30]}]
set_load -pin_load 0.05 [get_ports {pc_curr[29]}]
set_load -pin_load 0.05 [get_ports {pc_curr[28]}]
set_load -pin_load 0.05 [get_ports {pc_curr[27]}]
set_load -pin_load 0.05 [get_ports {pc_curr[26]}]
set_load -pin_load 0.05 [get_ports {pc_curr[25]}]
set_load -pin_load 0.05 [get_ports {pc_curr[24]}]
set_load -pin_load 0.05 [get_ports {pc_curr[23]}]
set_load -pin_load 0.05 [get_ports {pc_curr[22]}]
set_load -pin_load 0.05 [get_ports {pc_curr[21]}]
set_load -pin_load 0.05 [get_ports {pc_curr[20]}]
set_load -pin_load 0.05 [get_ports {pc_curr[19]}]
set_load -pin_load 0.05 [get_ports {pc_curr[18]}]
set_load -pin_load 0.05 [get_ports {pc_curr[17]}]
set_load -pin_load 0.05 [get_ports {pc_curr[16]}]
set_load -pin_load 0.05 [get_ports {pc_curr[15]}]
set_load -pin_load 0.05 [get_ports {pc_curr[14]}]
set_load -pin_load 0.05 [get_ports {pc_curr[13]}]
set_load -pin_load 0.05 [get_ports {pc_curr[12]}]
set_load -pin_load 0.05 [get_ports {pc_curr[11]}]
set_load -pin_load 0.05 [get_ports {pc_curr[10]}]
set_load -pin_load 0.05 [get_ports {pc_curr[9]}]
set_load -pin_load 0.05 [get_ports {pc_curr[8]}]
set_load -pin_load 0.05 [get_ports {pc_curr[7]}]
set_load -pin_load 0.05 [get_ports {pc_curr[6]}]
set_load -pin_load 0.05 [get_ports {pc_curr[5]}]
set_load -pin_load 0.05 [get_ports {pc_curr[4]}]
set_load -pin_load 0.05 [get_ports {pc_curr[3]}]
set_load -pin_load 0.05 [get_ports {pc_curr[2]}]
set_load -pin_load 0.05 [get_ports {pc_curr[1]}]
set_load -pin_load 0.05 [get_ports {pc_curr[0]}]
set_load -pin_load 0.05 [get_ports {instr[31]}]
set_load -pin_load 0.05 [get_ports {instr[30]}]
set_load -pin_load 0.05 [get_ports {instr[29]}]
set_load -pin_load 0.05 [get_ports {instr[28]}]
set_load -pin_load 0.05 [get_ports {instr[27]}]
set_load -pin_load 0.05 [get_ports {instr[26]}]
set_load -pin_load 0.05 [get_ports {instr[25]}]
set_load -pin_load 0.05 [get_ports {instr[24]}]
set_load -pin_load 0.05 [get_ports {instr[23]}]
set_load -pin_load 0.05 [get_ports {instr[22]}]
set_load -pin_load 0.05 [get_ports {instr[21]}]
set_load -pin_load 0.05 [get_ports {instr[20]}]
set_load -pin_load 0.05 [get_ports {instr[19]}]
set_load -pin_load 0.05 [get_ports {instr[18]}]
set_load -pin_load 0.05 [get_ports {instr[17]}]
set_load -pin_load 0.05 [get_ports {instr[16]}]
set_load -pin_load 0.05 [get_ports {instr[15]}]
set_load -pin_load 0.05 [get_ports {instr[14]}]
set_load -pin_load 0.05 [get_ports {instr[13]}]
set_load -pin_load 0.05 [get_ports {instr[12]}]
set_load -pin_load 0.05 [get_ports {instr[11]}]
set_load -pin_load 0.05 [get_ports {instr[10]}]
set_load -pin_load 0.05 [get_ports {instr[9]}]
set_load -pin_load 0.05 [get_ports {instr[8]}]
set_load -pin_load 0.05 [get_ports {instr[7]}]
set_load -pin_load 0.05 [get_ports {instr[6]}]
set_load -pin_load 0.05 [get_ports {instr[5]}]
set_load -pin_load 0.05 [get_ports {instr[4]}]
set_load -pin_load 0.05 [get_ports {instr[3]}]
set_load -pin_load 0.05 [get_ports {instr[2]}]
set_load -pin_load 0.05 [get_ports {instr[1]}]
set_load -pin_load 0.05 [get_ports {instr[0]}]
set_load -pin_load 0.05 [get_ports {x1[31]}]
set_load -pin_load 0.05 [get_ports {x1[30]}]
set_load -pin_load 0.05 [get_ports {x1[29]}]
set_load -pin_load 0.05 [get_ports {x1[28]}]
set_load -pin_load 0.05 [get_ports {x1[27]}]
set_load -pin_load 0.05 [get_ports {x1[26]}]
set_load -pin_load 0.05 [get_ports {x1[25]}]
set_load -pin_load 0.05 [get_ports {x1[24]}]
set_load -pin_load 0.05 [get_ports {x1[23]}]
set_load -pin_load 0.05 [get_ports {x1[22]}]
set_load -pin_load 0.05 [get_ports {x1[21]}]
set_load -pin_load 0.05 [get_ports {x1[20]}]
set_load -pin_load 0.05 [get_ports {x1[19]}]
set_load -pin_load 0.05 [get_ports {x1[18]}]
set_load -pin_load 0.05 [get_ports {x1[17]}]
set_load -pin_load 0.05 [get_ports {x1[16]}]
set_load -pin_load 0.05 [get_ports {x1[15]}]
set_load -pin_load 0.05 [get_ports {x1[14]}]
set_load -pin_load 0.05 [get_ports {x1[13]}]
set_load -pin_load 0.05 [get_ports {x1[12]}]
set_load -pin_load 0.05 [get_ports {x1[11]}]
set_load -pin_load 0.05 [get_ports {x1[10]}]
set_load -pin_load 0.05 [get_ports {x1[9]}]
set_load -pin_load 0.05 [get_ports {x1[8]}]
set_load -pin_load 0.05 [get_ports {x1[7]}]
set_load -pin_load 0.05 [get_ports {x1[6]}]
set_load -pin_load 0.05 [get_ports {x1[5]}]
set_load -pin_load 0.05 [get_ports {x1[4]}]
set_load -pin_load 0.05 [get_ports {x1[3]}]
set_load -pin_load 0.05 [get_ports {x1[2]}]
set_load -pin_load 0.05 [get_ports {x1[1]}]
set_load -pin_load 0.05 [get_ports {x1[0]}]
set_load -pin_load 0.05 [get_ports {x2[31]}]
set_load -pin_load 0.05 [get_ports {x2[30]}]
set_load -pin_load 0.05 [get_ports {x2[29]}]
set_load -pin_load 0.05 [get_ports {x2[28]}]
set_load -pin_load 0.05 [get_ports {x2[27]}]
set_load -pin_load 0.05 [get_ports {x2[26]}]
set_load -pin_load 0.05 [get_ports {x2[25]}]
set_load -pin_load 0.05 [get_ports {x2[24]}]
set_load -pin_load 0.05 [get_ports {x2[23]}]
set_load -pin_load 0.05 [get_ports {x2[22]}]
set_load -pin_load 0.05 [get_ports {x2[21]}]
set_load -pin_load 0.05 [get_ports {x2[20]}]
set_load -pin_load 0.05 [get_ports {x2[19]}]
set_load -pin_load 0.05 [get_ports {x2[18]}]
set_load -pin_load 0.05 [get_ports {x2[17]}]
set_load -pin_load 0.05 [get_ports {x2[16]}]
set_load -pin_load 0.05 [get_ports {x2[15]}]
set_load -pin_load 0.05 [get_ports {x2[14]}]
set_load -pin_load 0.05 [get_ports {x2[13]}]
set_load -pin_load 0.05 [get_ports {x2[12]}]
set_load -pin_load 0.05 [get_ports {x2[11]}]
set_load -pin_load 0.05 [get_ports {x2[10]}]
set_load -pin_load 0.05 [get_ports {x2[9]}]
set_load -pin_load 0.05 [get_ports {x2[8]}]
set_load -pin_load 0.05 [get_ports {x2[7]}]
set_load -pin_load 0.05 [get_ports {x2[6]}]
set_load -pin_load 0.05 [get_ports {x2[5]}]
set_load -pin_load 0.05 [get_ports {x2[4]}]
set_load -pin_load 0.05 [get_ports {x2[3]}]
set_load -pin_load 0.05 [get_ports {x2[2]}]
set_load -pin_load 0.05 [get_ports {x2[1]}]
set_load -pin_load 0.05 [get_ports {x2[0]}]
set_load -pin_load 0.05 [get_ports {x3[31]}]
set_load -pin_load 0.05 [get_ports {x3[30]}]
set_load -pin_load 0.05 [get_ports {x3[29]}]
set_load -pin_load 0.05 [get_ports {x3[28]}]
set_load -pin_load 0.05 [get_ports {x3[27]}]
set_load -pin_load 0.05 [get_ports {x3[26]}]
set_load -pin_load 0.05 [get_ports {x3[25]}]
set_load -pin_load 0.05 [get_ports {x3[24]}]
set_load -pin_load 0.05 [get_ports {x3[23]}]
set_load -pin_load 0.05 [get_ports {x3[22]}]
set_load -pin_load 0.05 [get_ports {x3[21]}]
set_load -pin_load 0.05 [get_ports {x3[20]}]
set_load -pin_load 0.05 [get_ports {x3[19]}]
set_load -pin_load 0.05 [get_ports {x3[18]}]
set_load -pin_load 0.05 [get_ports {x3[17]}]
set_load -pin_load 0.05 [get_ports {x3[16]}]
set_load -pin_load 0.05 [get_ports {x3[15]}]
set_load -pin_load 0.05 [get_ports {x3[14]}]
set_load -pin_load 0.05 [get_ports {x3[13]}]
set_load -pin_load 0.05 [get_ports {x3[12]}]
set_load -pin_load 0.05 [get_ports {x3[11]}]
set_load -pin_load 0.05 [get_ports {x3[10]}]
set_load -pin_load 0.05 [get_ports {x3[9]}]
set_load -pin_load 0.05 [get_ports {x3[8]}]
set_load -pin_load 0.05 [get_ports {x3[7]}]
set_load -pin_load 0.05 [get_ports {x3[6]}]
set_load -pin_load 0.05 [get_ports {x3[5]}]
set_load -pin_load 0.05 [get_ports {x3[4]}]
set_load -pin_load 0.05 [get_ports {x3[3]}]
set_load -pin_load 0.05 [get_ports {x3[2]}]
set_load -pin_load 0.05 [get_ports {x3[1]}]
set_load -pin_load 0.05 [get_ports {x3[0]}]
set_load -pin_load 0.05 [get_ports {x4[31]}]
set_load -pin_load 0.05 [get_ports {x4[30]}]
set_load -pin_load 0.05 [get_ports {x4[29]}]
set_load -pin_load 0.05 [get_ports {x4[28]}]
set_load -pin_load 0.05 [get_ports {x4[27]}]
set_load -pin_load 0.05 [get_ports {x4[26]}]
set_load -pin_load 0.05 [get_ports {x4[25]}]
set_load -pin_load 0.05 [get_ports {x4[24]}]
set_load -pin_load 0.05 [get_ports {x4[23]}]
set_load -pin_load 0.05 [get_ports {x4[22]}]
set_load -pin_load 0.05 [get_ports {x4[21]}]
set_load -pin_load 0.05 [get_ports {x4[20]}]
set_load -pin_load 0.05 [get_ports {x4[19]}]
set_load -pin_load 0.05 [get_ports {x4[18]}]
set_load -pin_load 0.05 [get_ports {x4[17]}]
set_load -pin_load 0.05 [get_ports {x4[16]}]
set_load -pin_load 0.05 [get_ports {x4[15]}]
set_load -pin_load 0.05 [get_ports {x4[14]}]
set_load -pin_load 0.05 [get_ports {x4[13]}]
set_load -pin_load 0.05 [get_ports {x4[12]}]
set_load -pin_load 0.05 [get_ports {x4[11]}]
set_load -pin_load 0.05 [get_ports {x4[10]}]
set_load -pin_load 0.05 [get_ports {x4[9]}]
set_load -pin_load 0.05 [get_ports {x4[8]}]
set_load -pin_load 0.05 [get_ports {x4[7]}]
set_load -pin_load 0.05 [get_ports {x4[6]}]
set_load -pin_load 0.05 [get_ports {x4[5]}]
set_load -pin_load 0.05 [get_ports {x4[4]}]
set_load -pin_load 0.05 [get_ports {x4[3]}]
set_load -pin_load 0.05 [get_ports {x4[2]}]
set_load -pin_load 0.05 [get_ports {x4[1]}]
set_load -pin_load 0.05 [get_ports {x4[0]}]
set_load -pin_load 0.05 [get_ports {x5[31]}]
set_load -pin_load 0.05 [get_ports {x5[30]}]
set_load -pin_load 0.05 [get_ports {x5[29]}]
set_load -pin_load 0.05 [get_ports {x5[28]}]
set_load -pin_load 0.05 [get_ports {x5[27]}]
set_load -pin_load 0.05 [get_ports {x5[26]}]
set_load -pin_load 0.05 [get_ports {x5[25]}]
set_load -pin_load 0.05 [get_ports {x5[24]}]
set_load -pin_load 0.05 [get_ports {x5[23]}]
set_load -pin_load 0.05 [get_ports {x5[22]}]
set_load -pin_load 0.05 [get_ports {x5[21]}]
set_load -pin_load 0.05 [get_ports {x5[20]}]
set_load -pin_load 0.05 [get_ports {x5[19]}]
set_load -pin_load 0.05 [get_ports {x5[18]}]
set_load -pin_load 0.05 [get_ports {x5[17]}]
set_load -pin_load 0.05 [get_ports {x5[16]}]
set_load -pin_load 0.05 [get_ports {x5[15]}]
set_load -pin_load 0.05 [get_ports {x5[14]}]
set_load -pin_load 0.05 [get_ports {x5[13]}]
set_load -pin_load 0.05 [get_ports {x5[12]}]
set_load -pin_load 0.05 [get_ports {x5[11]}]
set_load -pin_load 0.05 [get_ports {x5[10]}]
set_load -pin_load 0.05 [get_ports {x5[9]}]
set_load -pin_load 0.05 [get_ports {x5[8]}]
set_load -pin_load 0.05 [get_ports {x5[7]}]
set_load -pin_load 0.05 [get_ports {x5[6]}]
set_load -pin_load 0.05 [get_ports {x5[5]}]
set_load -pin_load 0.05 [get_ports {x5[4]}]
set_load -pin_load 0.05 [get_ports {x5[3]}]
set_load -pin_load 0.05 [get_ports {x5[2]}]
set_load -pin_load 0.05 [get_ports {x5[1]}]
set_load -pin_load 0.05 [get_ports {x5[0]}]
set_load -pin_load 0.05 [get_ports {x6[31]}]
set_load -pin_load 0.05 [get_ports {x6[30]}]
set_load -pin_load 0.05 [get_ports {x6[29]}]
set_load -pin_load 0.05 [get_ports {x6[28]}]
set_load -pin_load 0.05 [get_ports {x6[27]}]
set_load -pin_load 0.05 [get_ports {x6[26]}]
set_load -pin_load 0.05 [get_ports {x6[25]}]
set_load -pin_load 0.05 [get_ports {x6[24]}]
set_load -pin_load 0.05 [get_ports {x6[23]}]
set_load -pin_load 0.05 [get_ports {x6[22]}]
set_load -pin_load 0.05 [get_ports {x6[21]}]
set_load -pin_load 0.05 [get_ports {x6[20]}]
set_load -pin_load 0.05 [get_ports {x6[19]}]
set_load -pin_load 0.05 [get_ports {x6[18]}]
set_load -pin_load 0.05 [get_ports {x6[17]}]
set_load -pin_load 0.05 [get_ports {x6[16]}]
set_load -pin_load 0.05 [get_ports {x6[15]}]
set_load -pin_load 0.05 [get_ports {x6[14]}]
set_load -pin_load 0.05 [get_ports {x6[13]}]
set_load -pin_load 0.05 [get_ports {x6[12]}]
set_load -pin_load 0.05 [get_ports {x6[11]}]
set_load -pin_load 0.05 [get_ports {x6[10]}]
set_load -pin_load 0.05 [get_ports {x6[9]}]
set_load -pin_load 0.05 [get_ports {x6[8]}]
set_load -pin_load 0.05 [get_ports {x6[7]}]
set_load -pin_load 0.05 [get_ports {x6[6]}]
set_load -pin_load 0.05 [get_ports {x6[5]}]
set_load -pin_load 0.05 [get_ports {x6[4]}]
set_load -pin_load 0.05 [get_ports {x6[3]}]
set_load -pin_load 0.05 [get_ports {x6[2]}]
set_load -pin_load 0.05 [get_ports {x6[1]}]
set_load -pin_load 0.05 [get_ports {x6[0]}]
set_load -pin_load 0.05 [get_ports {mem0[31]}]
set_load -pin_load 0.05 [get_ports {mem0[30]}]
set_load -pin_load 0.05 [get_ports {mem0[29]}]
set_load -pin_load 0.05 [get_ports {mem0[28]}]
set_load -pin_load 0.05 [get_ports {mem0[27]}]
set_load -pin_load 0.05 [get_ports {mem0[26]}]
set_load -pin_load 0.05 [get_ports {mem0[25]}]
set_load -pin_load 0.05 [get_ports {mem0[24]}]
set_load -pin_load 0.05 [get_ports {mem0[23]}]
set_load -pin_load 0.05 [get_ports {mem0[22]}]
set_load -pin_load 0.05 [get_ports {mem0[21]}]
set_load -pin_load 0.05 [get_ports {mem0[20]}]
set_load -pin_load 0.05 [get_ports {mem0[19]}]
set_load -pin_load 0.05 [get_ports {mem0[18]}]
set_load -pin_load 0.05 [get_ports {mem0[17]}]
set_load -pin_load 0.05 [get_ports {mem0[16]}]
set_load -pin_load 0.05 [get_ports {mem0[15]}]
set_load -pin_load 0.05 [get_ports {mem0[14]}]
set_load -pin_load 0.05 [get_ports {mem0[13]}]
set_load -pin_load 0.05 [get_ports {mem0[12]}]
set_load -pin_load 0.05 [get_ports {mem0[11]}]
set_load -pin_load 0.05 [get_ports {mem0[10]}]
set_load -pin_load 0.05 [get_ports {mem0[9]}]
set_load -pin_load 0.05 [get_ports {mem0[8]}]
set_load -pin_load 0.05 [get_ports {mem0[7]}]
set_load -pin_load 0.05 [get_ports {mem0[6]}]
set_load -pin_load 0.05 [get_ports {mem0[5]}]
set_load -pin_load 0.05 [get_ports {mem0[4]}]
set_load -pin_load 0.05 [get_ports {mem0[3]}]
set_load -pin_load 0.05 [get_ports {mem0[2]}]
set_load -pin_load 0.05 [get_ports {mem0[1]}]
set_load -pin_load 0.05 [get_ports {mem0[0]}]
set_load -pin_load 0.05 [get_ports {mem1[31]}]
set_load -pin_load 0.05 [get_ports {mem1[30]}]
set_load -pin_load 0.05 [get_ports {mem1[29]}]
set_load -pin_load 0.05 [get_ports {mem1[28]}]
set_load -pin_load 0.05 [get_ports {mem1[27]}]
set_load -pin_load 0.05 [get_ports {mem1[26]}]
set_load -pin_load 0.05 [get_ports {mem1[25]}]
set_load -pin_load 0.05 [get_ports {mem1[24]}]
set_load -pin_load 0.05 [get_ports {mem1[23]}]
set_load -pin_load 0.05 [get_ports {mem1[22]}]
set_load -pin_load 0.05 [get_ports {mem1[21]}]
set_load -pin_load 0.05 [get_ports {mem1[20]}]
set_load -pin_load 0.05 [get_ports {mem1[19]}]
set_load -pin_load 0.05 [get_ports {mem1[18]}]
set_load -pin_load 0.05 [get_ports {mem1[17]}]
set_load -pin_load 0.05 [get_ports {mem1[16]}]
set_load -pin_load 0.05 [get_ports {mem1[15]}]
set_load -pin_load 0.05 [get_ports {mem1[14]}]
set_load -pin_load 0.05 [get_ports {mem1[13]}]
set_load -pin_load 0.05 [get_ports {mem1[12]}]
set_load -pin_load 0.05 [get_ports {mem1[11]}]
set_load -pin_load 0.05 [get_ports {mem1[10]}]
set_load -pin_load 0.05 [get_ports {mem1[9]}]
set_load -pin_load 0.05 [get_ports {mem1[8]}]
set_load -pin_load 0.05 [get_ports {mem1[7]}]
set_load -pin_load 0.05 [get_ports {mem1[6]}]
set_load -pin_load 0.05 [get_ports {mem1[5]}]
set_load -pin_load 0.05 [get_ports {mem1[4]}]
set_load -pin_load 0.05 [get_ports {mem1[3]}]
set_load -pin_load 0.05 [get_ports {mem1[2]}]
set_load -pin_load 0.05 [get_ports {mem1[1]}]
set_load -pin_load 0.05 [get_ports {mem1[0]}]
set_load -pin_load 0.05 [get_ports {mem2[31]}]
set_load -pin_load 0.05 [get_ports {mem2[30]}]
set_load -pin_load 0.05 [get_ports {mem2[29]}]
set_load -pin_load 0.05 [get_ports {mem2[28]}]
set_load -pin_load 0.05 [get_ports {mem2[27]}]
set_load -pin_load 0.05 [get_ports {mem2[26]}]
set_load -pin_load 0.05 [get_ports {mem2[25]}]
set_load -pin_load 0.05 [get_ports {mem2[24]}]
set_load -pin_load 0.05 [get_ports {mem2[23]}]
set_load -pin_load 0.05 [get_ports {mem2[22]}]
set_load -pin_load 0.05 [get_ports {mem2[21]}]
set_load -pin_load 0.05 [get_ports {mem2[20]}]
set_load -pin_load 0.05 [get_ports {mem2[19]}]
set_load -pin_load 0.05 [get_ports {mem2[18]}]
set_load -pin_load 0.05 [get_ports {mem2[17]}]
set_load -pin_load 0.05 [get_ports {mem2[16]}]
set_load -pin_load 0.05 [get_ports {mem2[15]}]
set_load -pin_load 0.05 [get_ports {mem2[14]}]
set_load -pin_load 0.05 [get_ports {mem2[13]}]
set_load -pin_load 0.05 [get_ports {mem2[12]}]
set_load -pin_load 0.05 [get_ports {mem2[11]}]
set_load -pin_load 0.05 [get_ports {mem2[10]}]
set_load -pin_load 0.05 [get_ports {mem2[9]}]
set_load -pin_load 0.05 [get_ports {mem2[8]}]
set_load -pin_load 0.05 [get_ports {mem2[7]}]
set_load -pin_load 0.05 [get_ports {mem2[6]}]
set_load -pin_load 0.05 [get_ports {mem2[5]}]
set_load -pin_load 0.05 [get_ports {mem2[4]}]
set_load -pin_load 0.05 [get_ports {mem2[3]}]
set_load -pin_load 0.05 [get_ports {mem2[2]}]
set_load -pin_load 0.05 [get_ports {mem2[1]}]
set_load -pin_load 0.05 [get_ports {mem2[0]}]
set_load -pin_load 0.05 [get_ports {mem3[31]}]
set_load -pin_load 0.05 [get_ports {mem3[30]}]
set_load -pin_load 0.05 [get_ports {mem3[29]}]
set_load -pin_load 0.05 [get_ports {mem3[28]}]
set_load -pin_load 0.05 [get_ports {mem3[27]}]
set_load -pin_load 0.05 [get_ports {mem3[26]}]
set_load -pin_load 0.05 [get_ports {mem3[25]}]
set_load -pin_load 0.05 [get_ports {mem3[24]}]
set_load -pin_load 0.05 [get_ports {mem3[23]}]
set_load -pin_load 0.05 [get_ports {mem3[22]}]
set_load -pin_load 0.05 [get_ports {mem3[21]}]
set_load -pin_load 0.05 [get_ports {mem3[20]}]
set_load -pin_load 0.05 [get_ports {mem3[19]}]
set_load -pin_load 0.05 [get_ports {mem3[18]}]
set_load -pin_load 0.05 [get_ports {mem3[17]}]
set_load -pin_load 0.05 [get_ports {mem3[16]}]
set_load -pin_load 0.05 [get_ports {mem3[15]}]
set_load -pin_load 0.05 [get_ports {mem3[14]}]
set_load -pin_load 0.05 [get_ports {mem3[13]}]
set_load -pin_load 0.05 [get_ports {mem3[12]}]
set_load -pin_load 0.05 [get_ports {mem3[11]}]
set_load -pin_load 0.05 [get_ports {mem3[10]}]
set_load -pin_load 0.05 [get_ports {mem3[9]}]
set_load -pin_load 0.05 [get_ports {mem3[8]}]
set_load -pin_load 0.05 [get_ports {mem3[7]}]
set_load -pin_load 0.05 [get_ports {mem3[6]}]
set_load -pin_load 0.05 [get_ports {mem3[5]}]
set_load -pin_load 0.05 [get_ports {mem3[4]}]
set_load -pin_load 0.05 [get_ports {mem3[3]}]
set_load -pin_load 0.05 [get_ports {mem3[2]}]
set_load -pin_load 0.05 [get_ports {mem3[1]}]
set_load -pin_load 0.05 [get_ports {mem3[0]}]
set_load -pin_load 0.05 [get_ports {mem4[31]}]
set_load -pin_load 0.05 [get_ports {mem4[30]}]
set_load -pin_load 0.05 [get_ports {mem4[29]}]
set_load -pin_load 0.05 [get_ports {mem4[28]}]
set_load -pin_load 0.05 [get_ports {mem4[27]}]
set_load -pin_load 0.05 [get_ports {mem4[26]}]
set_load -pin_load 0.05 [get_ports {mem4[25]}]
set_load -pin_load 0.05 [get_ports {mem4[24]}]
set_load -pin_load 0.05 [get_ports {mem4[23]}]
set_load -pin_load 0.05 [get_ports {mem4[22]}]
set_load -pin_load 0.05 [get_ports {mem4[21]}]
set_load -pin_load 0.05 [get_ports {mem4[20]}]
set_load -pin_load 0.05 [get_ports {mem4[19]}]
set_load -pin_load 0.05 [get_ports {mem4[18]}]
set_load -pin_load 0.05 [get_ports {mem4[17]}]
set_load -pin_load 0.05 [get_ports {mem4[16]}]
set_load -pin_load 0.05 [get_ports {mem4[15]}]
set_load -pin_load 0.05 [get_ports {mem4[14]}]
set_load -pin_load 0.05 [get_ports {mem4[13]}]
set_load -pin_load 0.05 [get_ports {mem4[12]}]
set_load -pin_load 0.05 [get_ports {mem4[11]}]
set_load -pin_load 0.05 [get_ports {mem4[10]}]
set_load -pin_load 0.05 [get_ports {mem4[9]}]
set_load -pin_load 0.05 [get_ports {mem4[8]}]
set_load -pin_load 0.05 [get_ports {mem4[7]}]
set_load -pin_load 0.05 [get_ports {mem4[6]}]
set_load -pin_load 0.05 [get_ports {mem4[5]}]
set_load -pin_load 0.05 [get_ports {mem4[4]}]
set_load -pin_load 0.05 [get_ports {mem4[3]}]
set_load -pin_load 0.05 [get_ports {mem4[2]}]
set_load -pin_load 0.05 [get_ports {mem4[1]}]
set_load -pin_load 0.05 [get_ports {mem4[0]}]
set_load -pin_load 0.05 [get_ports {mem5[31]}]
set_load -pin_load 0.05 [get_ports {mem5[30]}]
set_load -pin_load 0.05 [get_ports {mem5[29]}]
set_load -pin_load 0.05 [get_ports {mem5[28]}]
set_load -pin_load 0.05 [get_ports {mem5[27]}]
set_load -pin_load 0.05 [get_ports {mem5[26]}]
set_load -pin_load 0.05 [get_ports {mem5[25]}]
set_load -pin_load 0.05 [get_ports {mem5[24]}]
set_load -pin_load 0.05 [get_ports {mem5[23]}]
set_load -pin_load 0.05 [get_ports {mem5[22]}]
set_load -pin_load 0.05 [get_ports {mem5[21]}]
set_load -pin_load 0.05 [get_ports {mem5[20]}]
set_load -pin_load 0.05 [get_ports {mem5[19]}]
set_load -pin_load 0.05 [get_ports {mem5[18]}]
set_load -pin_load 0.05 [get_ports {mem5[17]}]
set_load -pin_load 0.05 [get_ports {mem5[16]}]
set_load -pin_load 0.05 [get_ports {mem5[15]}]
set_load -pin_load 0.05 [get_ports {mem5[14]}]
set_load -pin_load 0.05 [get_ports {mem5[13]}]
set_load -pin_load 0.05 [get_ports {mem5[12]}]
set_load -pin_load 0.05 [get_ports {mem5[11]}]
set_load -pin_load 0.05 [get_ports {mem5[10]}]
set_load -pin_load 0.05 [get_ports {mem5[9]}]
set_load -pin_load 0.05 [get_ports {mem5[8]}]
set_load -pin_load 0.05 [get_ports {mem5[7]}]
set_load -pin_load 0.05 [get_ports {mem5[6]}]
set_load -pin_load 0.05 [get_ports {mem5[5]}]
set_load -pin_load 0.05 [get_ports {mem5[4]}]
set_load -pin_load 0.05 [get_ports {mem5[3]}]
set_load -pin_load 0.05 [get_ports {mem5[2]}]
set_load -pin_load 0.05 [get_ports {mem5[1]}]
set_load -pin_load 0.05 [get_ports {mem5[0]}]
set_load -pin_load 0.05 [get_ports {mem6[31]}]
set_load -pin_load 0.05 [get_ports {mem6[30]}]
set_load -pin_load 0.05 [get_ports {mem6[29]}]
set_load -pin_load 0.05 [get_ports {mem6[28]}]
set_load -pin_load 0.05 [get_ports {mem6[27]}]
set_load -pin_load 0.05 [get_ports {mem6[26]}]
set_load -pin_load 0.05 [get_ports {mem6[25]}]
set_load -pin_load 0.05 [get_ports {mem6[24]}]
set_load -pin_load 0.05 [get_ports {mem6[23]}]
set_load -pin_load 0.05 [get_ports {mem6[22]}]
set_load -pin_load 0.05 [get_ports {mem6[21]}]
set_load -pin_load 0.05 [get_ports {mem6[20]}]
set_load -pin_load 0.05 [get_ports {mem6[19]}]
set_load -pin_load 0.05 [get_ports {mem6[18]}]
set_load -pin_load 0.05 [get_ports {mem6[17]}]
set_load -pin_load 0.05 [get_ports {mem6[16]}]
set_load -pin_load 0.05 [get_ports {mem6[15]}]
set_load -pin_load 0.05 [get_ports {mem6[14]}]
set_load -pin_load 0.05 [get_ports {mem6[13]}]
set_load -pin_load 0.05 [get_ports {mem6[12]}]
set_load -pin_load 0.05 [get_ports {mem6[11]}]
set_load -pin_load 0.05 [get_ports {mem6[10]}]
set_load -pin_load 0.05 [get_ports {mem6[9]}]
set_load -pin_load 0.05 [get_ports {mem6[8]}]
set_load -pin_load 0.05 [get_ports {mem6[7]}]
set_load -pin_load 0.05 [get_ports {mem6[6]}]
set_load -pin_load 0.05 [get_ports {mem6[5]}]
set_load -pin_load 0.05 [get_ports {mem6[4]}]
set_load -pin_load 0.05 [get_ports {mem6[3]}]
set_load -pin_load 0.05 [get_ports {mem6[2]}]
set_load -pin_load 0.05 [get_ports {mem6[1]}]
set_load -pin_load 0.05 [get_ports {mem6[0]}]
set_load -pin_load 0.05 [get_ports {mem7[31]}]
set_load -pin_load 0.05 [get_ports {mem7[30]}]
set_load -pin_load 0.05 [get_ports {mem7[29]}]
set_load -pin_load 0.05 [get_ports {mem7[28]}]
set_load -pin_load 0.05 [get_ports {mem7[27]}]
set_load -pin_load 0.05 [get_ports {mem7[26]}]
set_load -pin_load 0.05 [get_ports {mem7[25]}]
set_load -pin_load 0.05 [get_ports {mem7[24]}]
set_load -pin_load 0.05 [get_ports {mem7[23]}]
set_load -pin_load 0.05 [get_ports {mem7[22]}]
set_load -pin_load 0.05 [get_ports {mem7[21]}]
set_load -pin_load 0.05 [get_ports {mem7[20]}]
set_load -pin_load 0.05 [get_ports {mem7[19]}]
set_load -pin_load 0.05 [get_ports {mem7[18]}]
set_load -pin_load 0.05 [get_ports {mem7[17]}]
set_load -pin_load 0.05 [get_ports {mem7[16]}]
set_load -pin_load 0.05 [get_ports {mem7[15]}]
set_load -pin_load 0.05 [get_ports {mem7[14]}]
set_load -pin_load 0.05 [get_ports {mem7[13]}]
set_load -pin_load 0.05 [get_ports {mem7[12]}]
set_load -pin_load 0.05 [get_ports {mem7[11]}]
set_load -pin_load 0.05 [get_ports {mem7[10]}]
set_load -pin_load 0.05 [get_ports {mem7[9]}]
set_load -pin_load 0.05 [get_ports {mem7[8]}]
set_load -pin_load 0.05 [get_ports {mem7[7]}]
set_load -pin_load 0.05 [get_ports {mem7[6]}]
set_load -pin_load 0.05 [get_ports {mem7[5]}]
set_load -pin_load 0.05 [get_ports {mem7[4]}]
set_load -pin_load 0.05 [get_ports {mem7[3]}]
set_load -pin_load 0.05 [get_ports {mem7[2]}]
set_load -pin_load 0.05 [get_ports {mem7[1]}]
set_load -pin_load 0.05 [get_ports {mem7[0]}]
set_load -pin_load 0.05 [get_ports {mem8[31]}]
set_load -pin_load 0.05 [get_ports {mem8[30]}]
set_load -pin_load 0.05 [get_ports {mem8[29]}]
set_load -pin_load 0.05 [get_ports {mem8[28]}]
set_load -pin_load 0.05 [get_ports {mem8[27]}]
set_load -pin_load 0.05 [get_ports {mem8[26]}]
set_load -pin_load 0.05 [get_ports {mem8[25]}]
set_load -pin_load 0.05 [get_ports {mem8[24]}]
set_load -pin_load 0.05 [get_ports {mem8[23]}]
set_load -pin_load 0.05 [get_ports {mem8[22]}]
set_load -pin_load 0.05 [get_ports {mem8[21]}]
set_load -pin_load 0.05 [get_ports {mem8[20]}]
set_load -pin_load 0.05 [get_ports {mem8[19]}]
set_load -pin_load 0.05 [get_ports {mem8[18]}]
set_load -pin_load 0.05 [get_ports {mem8[17]}]
set_load -pin_load 0.05 [get_ports {mem8[16]}]
set_load -pin_load 0.05 [get_ports {mem8[15]}]
set_load -pin_load 0.05 [get_ports {mem8[14]}]
set_load -pin_load 0.05 [get_ports {mem8[13]}]
set_load -pin_load 0.05 [get_ports {mem8[12]}]
set_load -pin_load 0.05 [get_ports {mem8[11]}]
set_load -pin_load 0.05 [get_ports {mem8[10]}]
set_load -pin_load 0.05 [get_ports {mem8[9]}]
set_load -pin_load 0.05 [get_ports {mem8[8]}]
set_load -pin_load 0.05 [get_ports {mem8[7]}]
set_load -pin_load 0.05 [get_ports {mem8[6]}]
set_load -pin_load 0.05 [get_ports {mem8[5]}]
set_load -pin_load 0.05 [get_ports {mem8[4]}]
set_load -pin_load 0.05 [get_ports {mem8[3]}]
set_load -pin_load 0.05 [get_ports {mem8[2]}]
set_load -pin_load 0.05 [get_ports {mem8[1]}]
set_load -pin_load 0.05 [get_ports {mem8[0]}]
set_load -pin_load 0.05 [get_ports {mem9[31]}]
set_load -pin_load 0.05 [get_ports {mem9[30]}]
set_load -pin_load 0.05 [get_ports {mem9[29]}]
set_load -pin_load 0.05 [get_ports {mem9[28]}]
set_load -pin_load 0.05 [get_ports {mem9[27]}]
set_load -pin_load 0.05 [get_ports {mem9[26]}]
set_load -pin_load 0.05 [get_ports {mem9[25]}]
set_load -pin_load 0.05 [get_ports {mem9[24]}]
set_load -pin_load 0.05 [get_ports {mem9[23]}]
set_load -pin_load 0.05 [get_ports {mem9[22]}]
set_load -pin_load 0.05 [get_ports {mem9[21]}]
set_load -pin_load 0.05 [get_ports {mem9[20]}]
set_load -pin_load 0.05 [get_ports {mem9[19]}]
set_load -pin_load 0.05 [get_ports {mem9[18]}]
set_load -pin_load 0.05 [get_ports {mem9[17]}]
set_load -pin_load 0.05 [get_ports {mem9[16]}]
set_load -pin_load 0.05 [get_ports {mem9[15]}]
set_load -pin_load 0.05 [get_ports {mem9[14]}]
set_load -pin_load 0.05 [get_ports {mem9[13]}]
set_load -pin_load 0.05 [get_ports {mem9[12]}]
set_load -pin_load 0.05 [get_ports {mem9[11]}]
set_load -pin_load 0.05 [get_ports {mem9[10]}]
set_load -pin_load 0.05 [get_ports {mem9[9]}]
set_load -pin_load 0.05 [get_ports {mem9[8]}]
set_load -pin_load 0.05 [get_ports {mem9[7]}]
set_load -pin_load 0.05 [get_ports {mem9[6]}]
set_load -pin_load 0.05 [get_ports {mem9[5]}]
set_load -pin_load 0.05 [get_ports {mem9[4]}]
set_load -pin_load 0.05 [get_ports {mem9[3]}]
set_load -pin_load 0.05 [get_ports {mem9[2]}]
set_load -pin_load 0.05 [get_ports {mem9[1]}]
set_load -pin_load 0.05 [get_ports {mem9[0]}]
set_load -pin_load 0.05 [get_ports {mem10[31]}]
set_load -pin_load 0.05 [get_ports {mem10[30]}]
set_load -pin_load 0.05 [get_ports {mem10[29]}]
set_load -pin_load 0.05 [get_ports {mem10[28]}]
set_load -pin_load 0.05 [get_ports {mem10[27]}]
set_load -pin_load 0.05 [get_ports {mem10[26]}]
set_load -pin_load 0.05 [get_ports {mem10[25]}]
set_load -pin_load 0.05 [get_ports {mem10[24]}]
set_load -pin_load 0.05 [get_ports {mem10[23]}]
set_load -pin_load 0.05 [get_ports {mem10[22]}]
set_load -pin_load 0.05 [get_ports {mem10[21]}]
set_load -pin_load 0.05 [get_ports {mem10[20]}]
set_load -pin_load 0.05 [get_ports {mem10[19]}]
set_load -pin_load 0.05 [get_ports {mem10[18]}]
set_load -pin_load 0.05 [get_ports {mem10[17]}]
set_load -pin_load 0.05 [get_ports {mem10[16]}]
set_load -pin_load 0.05 [get_ports {mem10[15]}]
set_load -pin_load 0.05 [get_ports {mem10[14]}]
set_load -pin_load 0.05 [get_ports {mem10[13]}]
set_load -pin_load 0.05 [get_ports {mem10[12]}]
set_load -pin_load 0.05 [get_ports {mem10[11]}]
set_load -pin_load 0.05 [get_ports {mem10[10]}]
set_load -pin_load 0.05 [get_ports {mem10[9]}]
set_load -pin_load 0.05 [get_ports {mem10[8]}]
set_load -pin_load 0.05 [get_ports {mem10[7]}]
set_load -pin_load 0.05 [get_ports {mem10[6]}]
set_load -pin_load 0.05 [get_ports {mem10[5]}]
set_load -pin_load 0.05 [get_ports {mem10[4]}]
set_load -pin_load 0.05 [get_ports {mem10[3]}]
set_load -pin_load 0.05 [get_ports {mem10[2]}]
set_load -pin_load 0.05 [get_ports {mem10[1]}]
set_load -pin_load 0.05 [get_ports {mem10[0]}]
set_load -pin_load 0.05 [get_ports {mem11[31]}]
set_load -pin_load 0.05 [get_ports {mem11[30]}]
set_load -pin_load 0.05 [get_ports {mem11[29]}]
set_load -pin_load 0.05 [get_ports {mem11[28]}]
set_load -pin_load 0.05 [get_ports {mem11[27]}]
set_load -pin_load 0.05 [get_ports {mem11[26]}]
set_load -pin_load 0.05 [get_ports {mem11[25]}]
set_load -pin_load 0.05 [get_ports {mem11[24]}]
set_load -pin_load 0.05 [get_ports {mem11[23]}]
set_load -pin_load 0.05 [get_ports {mem11[22]}]
set_load -pin_load 0.05 [get_ports {mem11[21]}]
set_load -pin_load 0.05 [get_ports {mem11[20]}]
set_load -pin_load 0.05 [get_ports {mem11[19]}]
set_load -pin_load 0.05 [get_ports {mem11[18]}]
set_load -pin_load 0.05 [get_ports {mem11[17]}]
set_load -pin_load 0.05 [get_ports {mem11[16]}]
set_load -pin_load 0.05 [get_ports {mem11[15]}]
set_load -pin_load 0.05 [get_ports {mem11[14]}]
set_load -pin_load 0.05 [get_ports {mem11[13]}]
set_load -pin_load 0.05 [get_ports {mem11[12]}]
set_load -pin_load 0.05 [get_ports {mem11[11]}]
set_load -pin_load 0.05 [get_ports {mem11[10]}]
set_load -pin_load 0.05 [get_ports {mem11[9]}]
set_load -pin_load 0.05 [get_ports {mem11[8]}]
set_load -pin_load 0.05 [get_ports {mem11[7]}]
set_load -pin_load 0.05 [get_ports {mem11[6]}]
set_load -pin_load 0.05 [get_ports {mem11[5]}]
set_load -pin_load 0.05 [get_ports {mem11[4]}]
set_load -pin_load 0.05 [get_ports {mem11[3]}]
set_load -pin_load 0.05 [get_ports {mem11[2]}]
set_load -pin_load 0.05 [get_ports {mem11[1]}]
set_load -pin_load 0.05 [get_ports {mem11[0]}]
set_load -pin_load 0.05 [get_ports ram_sel]
set_load -pin_load 0.05 [get_ports i2c_sel]
set_load -pin_load 0.05 [get_ports ack]
set_load -pin_load 0.05 [get_ports stall]
set_load -pin_load 0.05 [get_ports {slave_mem0[7]}]
set_load -pin_load 0.05 [get_ports {slave_mem0[6]}]
set_load -pin_load 0.05 [get_ports {slave_mem0[5]}]
set_load -pin_load 0.05 [get_ports {slave_mem0[4]}]
set_load -pin_load 0.05 [get_ports {slave_mem0[3]}]
set_load -pin_load 0.05 [get_ports {slave_mem0[2]}]
set_load -pin_load 0.05 [get_ports {slave_mem0[1]}]
set_load -pin_load 0.05 [get_ports {slave_mem0[0]}]
set_load -pin_load 0.05 [get_ports {slave_mem1[7]}]
set_load -pin_load 0.05 [get_ports {slave_mem1[6]}]
set_load -pin_load 0.05 [get_ports {slave_mem1[5]}]
set_load -pin_load 0.05 [get_ports {slave_mem1[4]}]
set_load -pin_load 0.05 [get_ports {slave_mem1[3]}]
set_load -pin_load 0.05 [get_ports {slave_mem1[2]}]
set_load -pin_load 0.05 [get_ports {slave_mem1[1]}]
set_load -pin_load 0.05 [get_ports {slave_mem1[0]}]
set_load -pin_load 0.05 [get_ports {slave_mem2[7]}]
set_load -pin_load 0.05 [get_ports {slave_mem2[6]}]
set_load -pin_load 0.05 [get_ports {slave_mem2[5]}]
set_load -pin_load 0.05 [get_ports {slave_mem2[4]}]
set_load -pin_load 0.05 [get_ports {slave_mem2[3]}]
set_load -pin_load 0.05 [get_ports {slave_mem2[2]}]
set_load -pin_load 0.05 [get_ports {slave_mem2[1]}]
set_load -pin_load 0.05 [get_ports {slave_mem2[0]}]
set_load -pin_load 0.05 [get_ports {slave_mem3[7]}]
set_load -pin_load 0.05 [get_ports {slave_mem3[6]}]
set_load -pin_load 0.05 [get_ports {slave_mem3[5]}]
set_load -pin_load 0.05 [get_ports {slave_mem3[4]}]
set_load -pin_load 0.05 [get_ports {slave_mem3[3]}]
set_load -pin_load 0.05 [get_ports {slave_mem3[2]}]
set_load -pin_load 0.05 [get_ports {slave_mem3[1]}]
set_load -pin_load 0.05 [get_ports {slave_mem3[0]}]
set_load -pin_load 0.05 [get_ports {slave_mem4[7]}]
set_load -pin_load 0.05 [get_ports {slave_mem4[6]}]
set_load -pin_load 0.05 [get_ports {slave_mem4[5]}]
set_load -pin_load 0.05 [get_ports {slave_mem4[4]}]
set_load -pin_load 0.05 [get_ports {slave_mem4[3]}]
set_load -pin_load 0.05 [get_ports {slave_mem4[2]}]
set_load -pin_load 0.05 [get_ports {slave_mem4[1]}]
set_load -pin_load 0.05 [get_ports {slave_mem4[0]}]
set_load -pin_load 0.05 [get_ports {slave_mem5[7]}]
set_load -pin_load 0.05 [get_ports {slave_mem5[6]}]
set_load -pin_load 0.05 [get_ports {slave_mem5[5]}]
set_load -pin_load 0.05 [get_ports {slave_mem5[4]}]
set_load -pin_load 0.05 [get_ports {slave_mem5[3]}]
set_load -pin_load 0.05 [get_ports {slave_mem5[2]}]
set_load -pin_load 0.05 [get_ports {slave_mem5[1]}]
set_load -pin_load 0.05 [get_ports {slave_mem5[0]}]
set_load -pin_load 0.05 [get_ports {slave_mem6[7]}]
set_load -pin_load 0.05 [get_ports {slave_mem6[6]}]
set_load -pin_load 0.05 [get_ports {slave_mem6[5]}]
set_load -pin_load 0.05 [get_ports {slave_mem6[4]}]
set_load -pin_load 0.05 [get_ports {slave_mem6[3]}]
set_load -pin_load 0.05 [get_ports {slave_mem6[2]}]
set_load -pin_load 0.05 [get_ports {slave_mem6[1]}]
set_load -pin_load 0.05 [get_ports {slave_mem6[0]}]
set_load -pin_load 0.05 [get_ports {slave_mem7[7]}]
set_load -pin_load 0.05 [get_ports {slave_mem7[6]}]
set_load -pin_load 0.05 [get_ports {slave_mem7[5]}]
set_load -pin_load 0.05 [get_ports {slave_mem7[4]}]
set_load -pin_load 0.05 [get_ports {slave_mem7[3]}]
set_load -pin_load 0.05 [get_ports {slave_mem7[2]}]
set_load -pin_load 0.05 [get_ports {slave_mem7[1]}]
set_load -pin_load 0.05 [get_ports {slave_mem7[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.2  [get_clocks clk]
set_input_delay -clock clk  -max 2  [get_ports reset]
set_input_delay -clock clk  -min 0.5  [get_ports reset]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[31]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[30]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[29]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[28]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[27]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[26]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[25]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[24]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[23]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[22]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[21]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[20]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[19]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[18]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[17]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[16]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[15]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[14]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[13]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[12]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[11]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[10]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[9]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[8]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[7]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[6]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[5]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[4]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[3]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[2]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[1]}]
set_output_delay -clock clk  -max 2  [get_ports {pc_curr[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {pc_curr[0]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[31]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[30]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[29]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[28]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[27]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[26]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[25]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[24]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[23]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[22]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[21]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[20]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[19]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[18]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[17]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[16]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[15]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[14]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[13]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[12]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[11]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[10]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[9]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[8]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[7]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[6]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[5]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[4]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[3]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[2]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[1]}]
set_output_delay -clock clk  -max 2  [get_ports {instr[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {instr[0]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[31]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[30]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[29]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[28]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[27]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[26]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[25]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[24]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[23]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[22]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[21]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[20]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[19]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[18]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[17]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[16]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[15]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[14]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[13]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[12]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[11]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[10]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[9]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[8]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[7]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[6]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[5]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[4]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[3]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[2]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[1]}]
set_output_delay -clock clk  -max 2  [get_ports {x1[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x1[0]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[31]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[30]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[29]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[28]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[27]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[26]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[25]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[24]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[23]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[22]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[21]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[20]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[19]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[18]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[17]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[16]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[15]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[14]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[13]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[12]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[11]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[10]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[9]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[8]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[7]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[6]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[5]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[4]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[3]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[2]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[1]}]
set_output_delay -clock clk  -max 2  [get_ports {x2[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x2[0]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[31]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[30]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[29]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[28]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[27]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[26]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[25]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[24]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[23]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[22]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[21]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[20]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[19]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[18]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[17]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[16]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[15]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[14]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[13]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[12]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[11]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[10]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[9]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[8]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[7]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[6]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[5]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[4]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[3]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[2]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[1]}]
set_output_delay -clock clk  -max 2  [get_ports {x3[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x3[0]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[31]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[30]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[29]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[28]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[27]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[26]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[25]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[24]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[23]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[22]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[21]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[20]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[19]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[18]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[17]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[16]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[15]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[14]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[13]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[12]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[11]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[10]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[9]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[8]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[7]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[6]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[5]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[4]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[3]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[2]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[1]}]
set_output_delay -clock clk  -max 2  [get_ports {x4[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x4[0]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[31]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[30]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[29]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[28]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[27]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[26]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[25]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[24]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[23]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[22]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[21]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[20]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[19]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[18]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[17]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[16]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[15]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[14]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[13]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[12]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[11]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[10]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[9]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[8]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[7]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[6]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[5]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[4]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[3]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[2]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[1]}]
set_output_delay -clock clk  -max 2  [get_ports {x5[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x5[0]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[31]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[30]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[29]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[28]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[27]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[26]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[25]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[24]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[23]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[22]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[21]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[20]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[19]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[18]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[17]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[16]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[15]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[14]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[13]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[12]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[11]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[10]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[9]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[8]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[7]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[6]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[5]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[4]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[3]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[2]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[1]}]
set_output_delay -clock clk  -max 2  [get_ports {x6[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {x6[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem0[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem0[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem1[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem1[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem2[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem2[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem3[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem3[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem4[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem4[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem5[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem5[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem6[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem6[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem7[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem7[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem8[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem8[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem9[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem9[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem10[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem10[0]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[31]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[31]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[30]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[30]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[29]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[29]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[28]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[28]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[27]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[27]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[26]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[26]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[25]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[25]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[24]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[24]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[23]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[23]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[22]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[22]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[21]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[21]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[20]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[20]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[19]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[19]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[18]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[18]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[17]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[17]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[16]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[16]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[15]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[15]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[14]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[14]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[13]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[13]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[12]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[12]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[11]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[11]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[10]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[10]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[9]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[9]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[8]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[8]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[7]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[6]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[5]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[4]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[3]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[2]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[1]}]
set_output_delay -clock clk  -max 2  [get_ports {mem11[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {mem11[0]}]
set_output_delay -clock clk  -max 2  [get_ports ram_sel]
set_output_delay -clock clk  -min 0.5  [get_ports ram_sel]
set_output_delay -clock clk  -max 2  [get_ports i2c_sel]
set_output_delay -clock clk  -min 0.5  [get_ports i2c_sel]
set_output_delay -clock clk  -max 2  [get_ports ack]
set_output_delay -clock clk  -min 0.5  [get_ports ack]
set_output_delay -clock clk  -max 2  [get_ports stall]
set_output_delay -clock clk  -min 0.5  [get_ports stall]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem0[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem0[7]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem0[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem0[6]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem0[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem0[5]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem0[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem0[4]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem0[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem0[3]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem0[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem0[2]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem0[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem0[1]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem0[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem0[0]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem1[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem1[7]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem1[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem1[6]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem1[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem1[5]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem1[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem1[4]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem1[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem1[3]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem1[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem1[2]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem1[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem1[1]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem1[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem1[0]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem2[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem2[7]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem2[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem2[6]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem2[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem2[5]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem2[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem2[4]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem2[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem2[3]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem2[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem2[2]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem2[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem2[1]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem2[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem2[0]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem3[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem3[7]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem3[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem3[6]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem3[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem3[5]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem3[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem3[4]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem3[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem3[3]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem3[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem3[2]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem3[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem3[1]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem3[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem3[0]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem4[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem4[7]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem4[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem4[6]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem4[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem4[5]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem4[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem4[4]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem4[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem4[3]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem4[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem4[2]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem4[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem4[1]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem4[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem4[0]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem5[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem5[7]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem5[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem5[6]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem5[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem5[5]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem5[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem5[4]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem5[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem5[3]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem5[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem5[2]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem5[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem5[1]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem5[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem5[0]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem6[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem6[7]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem6[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem6[6]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem6[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem6[5]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem6[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem6[4]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem6[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem6[3]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem6[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem6[2]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem6[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem6[1]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem6[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem6[0]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem7[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem7[7]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem7[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem7[6]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem7[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem7[5]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem7[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem7[4]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem7[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem7[3]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem7[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem7[2]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem7[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem7[1]}]
set_output_delay -clock clk  -max 2  [get_ports {slave_mem7[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports {slave_mem7[0]}]
set_false_path   -from [get_ports reset]
